{
    "@odata.type":  "#microsoft.graph.windows10CompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "bce32296-7a26-4a2e-94a6-45289616570d",
    "createdDateTime":  "2019-07-09T14:49:05.6008003Z",
    "description":  "Device Compliance Policy for Windows Destop 10",
    "lastModifiedDateTime":  "2019-07-09T14:50:08.2498982Z",
    "displayName":  "Device-Compliance-Windows10-Desktop",
	"scheduledActionsForRule":[{"ruleName":"PasswordRequired","scheduledActionConfigurations":[{"actionType":"block","gracePeriodHours":0,"notificationTemplateId":""}]}],
    "version":  2,
    "passwordRequired":  true,
    "passwordBlockSimple":  true,
    "passwordRequiredToUnlockFromIdle":  true,
    "passwordMinutesOfInactivityBeforeLock":  15,
    "passwordExpirationDays":  null,
    "passwordMinimumLength":  null,
    "passwordMinimumCharacterSetCount":  1,
    "passwordRequiredType":  "alphanumeric",
    "passwordPreviousPasswordBlockCount":  null,
    "requireHealthyDeviceReport":  false,
    "osMinimumVersion":  null,
    "osMaximumVersion":  null,
    "mobileOsMinimumVersion":  null,
    "mobileOsMaximumVersion":  null,
    "earlyLaunchAntiMalwareDriverEnabled":  false,
    "bitLockerEnabled":  true,
    "secureBootEnabled":  true,
    "codeIntegrityEnabled":  true,
    "storageRequireEncryption":  false,
    "activeFirewallRequired":  true,
    "defenderEnabled":  false,
    "defenderVersion":  null,
    "signatureOutOfDate":  false,
    "rtpEnabled":  false,
    "antivirusRequired":  true,
    "antiSpywareRequired":  true,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "configurationManagerComplianceRequired":  false,
    "tpmRequired":  false,
    "validOperatingSystemBuildRanges":  [

                                        ]
}
